Revit 2027 API
BuiltInFailures.WallJoinFailures Class
 Failures about WallJoin.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.WallJoinFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class WallJoinFailures
Public NotInheritable Class WallJoinFailures
public ref class WallJoinFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type WallJoinFailures = class end
The BuiltInFailures.WallJoinFailures type exposes the following members.
Properties
Name | Description
FailedToChangeWallJointsTypeFailure |  Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed.
Top
See Also
Reference
Autodesk.Revit.DB Namespace